app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find(:artist_id)
      @songs = @artist.songs
   else
    @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"